app/controllers/appointments_controller.rb

SELECT `appointments`.* FROM `appointments`
---
  def index
    @appointments = Appointment.all