app/controllers/mains_controller.rb

  def index
    @mains = Main.all
---
SELECT `mains`.* FROM `mains`