app/controllers/register_controller.rb

  def create
    if params[:user][:password] == params[:user][:passwordc] and params[:user][:password] != "" and params[:user][:email] != "" and params[:user][:game_id] != "" and not(User.exists?(:game_id => params[:user][:game_id]))
      build_resource(sign_up_params)
      resource.game_id = params[:user][:game_id]
      resource.save
---
SELECT  1 AS one FROM `users` WHERE `users`.`email` = BINARY 'l4zou@uwaterloo.ca' LIMIT 1
INSERT INTO `users` (`email`, `encrypted_password`, `game_id`, `created_at`, `updated_at`) VALUES ('l4zou@uwaterloo.ca', '$2a$10$0YGvt3vUVkVfDHYP7puUCOLZLJp9kQqiMvGlXPSgY1j54ct1d7jnK', 'waxwam', '2015-08-20 05:21:03', '2015-08-20 05:21:03')